benchmark.log

This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking php (be patient)


Server Software:        nginx/1.16.0
Server Hostname:        php
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      100
Time taken for tests:   3.538 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      4870000 bytes
Total body sent:        4180000
HTML transferred:       3250000 bytes
Requests per second:    2826.65 [#/sec] (mean)
Time per request:       35.378 [ms] (mean)
Time per request:       0.354 [ms] (mean, across all concurrent requests)
Transfer rate:          1344.31 [Kbytes/sec] received
                        1153.85 kb/s sent
                        2498.16 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       8
Processing:     7   35  16.6     27     115
Waiting:        1   35  16.6     27     115
Total:          7   35  16.7     27     115

Percentage of the requests served within a certain time (ms)
  50%     27
  66%     30
  75%     39
  80%     48
  90%     61
  95%     68
  98%     86
  99%     97
 100%    115 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking php (be patient)


Server Software:        nginx/1.16.0
Server Hostname:        php
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      200
Time taken for tests:   4.598 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      4870000 bytes
Total body sent:        8180000
HTML transferred:       3250000 bytes
Requests per second:    2174.78 [#/sec] (mean)
Time per request:       91.963 [ms] (mean)
Time per request:       0.460 [ms] (mean, across all concurrent requests)
Transfer rate:          1034.29 [Kbytes/sec] received
                        1737.28 kb/s sent
                        2771.57 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.4      0      15
Processing:     5   55 201.6     34    3025
Waiting:        1   55 201.6     34    3024
Total:         15   55 201.9     34    3025

Percentage of the requests served within a certain time (ms)
  50%     34
  66%     35
  75%     36
  80%     37
  90%     39
  95%     42
  98%     47
  99%   1027
 100%   3025 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking php (be patient)


Server Software:        nginx/1.16.0
Server Hostname:        php
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      300
Time taken for tests:   4.191 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      4870000 bytes
Total body sent:        12190000
HTML transferred:       3250000 bytes
Requests per second:    2385.80 [#/sec] (mean)
Time per request:       125.744 [ms] (mean)
Time per request:       0.419 [ms] (mean, across all concurrent requests)
Transfer rate:          1134.65 [Kbytes/sec] received
                        2840.13 kb/s sent
                        3974.78 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.6      0      20
Processing:     8   96 415.1     34    4167
Waiting:        1   96 415.1     34    4167
Total:         21   97 416.5     34    4182

Percentage of the requests served within a certain time (ms)
  50%     34
  66%     35
  75%     36
  80%     36
  90%     39
  95%     70
  98%   1039
  99%   3091
 100%   4182 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking php (be patient)


Server Software:        nginx/1.16.0
Server Hostname:        php
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      400
Time taken for tests:   4.329 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      193
Total transferred:      4835646 bytes
Total body sent:        16190000
HTML transferred:       3217576 bytes
Requests per second:    2309.84 [#/sec] (mean)
Time per request:       173.172 [ms] (mean)
Time per request:       0.433 [ms] (mean, across all concurrent requests)
Transfer rate:          1090.78 [Kbytes/sec] received
                        3651.99 kb/s sent
                        4742.77 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.8      0      26
Processing:    12  131 474.1     34    4282
Waiting:        1  131 474.1     33    4281
Total:         22  132 475.9     34    4298

Percentage of the requests served within a certain time (ms)
  50%     34
  66%     35
  75%     36
  80%     37
  90%     44
  95%   1025
  98%   1222
  99%   3211
 100%   4298 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking php (be patient)


Server Software:        nginx/1.16.0
Server Hostname:        php
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      500
Time taken for tests:   4.334 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      96
Total transferred:      4852912 bytes
Total body sent:        20190000
HTML transferred:       3233872 bytes
Requests per second:    2307.39 [#/sec] (mean)
Time per request:       216.695 [ms] (mean)
Time per request:       0.433 [ms] (mean, across all concurrent requests)
Transfer rate:          1093.51 [Kbytes/sec] received
                        4549.43 kb/s sent
                        5642.94 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   4.6      0      31
Processing:    11  164 597.6     34    4294
Waiting:        1  164 597.6     34    4294
Total:         14  165 600.2     34    4312

Percentage of the requests served within a certain time (ms)
  50%     34
  66%     35
  75%     37
  80%     38
  90%     50
  95%   1032
  98%   3101
  99%   3290
 100%   4312 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking php (be patient)


Server Software:        nginx/1.16.0
Server Hostname:        php
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      600
Time taken for tests:   4.237 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      214
Total transferred:      4831908 bytes
Total body sent:        24190000
HTML transferred:       3214048 bytes
Requests per second:    2360.02 [#/sec] (mean)
Time per request:       254.235 [ms] (mean)
Time per request:       0.424 [ms] (mean, across all concurrent requests)
Transfer rate:          1113.61 [Kbytes/sec] received
                        5575.09 kb/s sent
                        6688.70 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   6.5      0      38
Processing:    14  191 666.7     34    4185
Waiting:        1  191 666.7     34    4185
Total:         22  193 671.3     35    4201

Percentage of the requests served within a certain time (ms)
  50%     35
  66%     36
  75%     37
  80%     38
  90%     43
  95%   1037
  98%   3312
  99%   3322
 100%   4201 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking php (be patient)


Server Software:        nginx/1.16.0
Server Hostname:        php
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      700
Time taken for tests:   4.570 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      190
Total transferred:      4836180 bytes
Total body sent:        28190000
HTML transferred:       3218080 bytes
Requests per second:    2188.23 [#/sec] (mean)
Time per request:       319.893 [ms] (mean)
Time per request:       0.457 [ms] (mean, across all concurrent requests)
Transfer rate:          1033.46 [Kbytes/sec] received
                        6024.04 kb/s sent
                        7057.50 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   7.9      0      47
Processing:    16  227 745.8     34    4241
Waiting:        1  227 745.8     34    4241
Total:         23  230 751.5     34    4275

Percentage of the requests served within a certain time (ms)
  50%     34
  66%     36
  75%     36
  80%     37
  90%    116
  95%   2598
  98%   3307
  99%   3319
 100%   4275 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking php (be patient)


Server Software:        nginx/1.16.0
Server Hostname:        php
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      800
Time taken for tests:   8.416 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      371
Total transferred:      4803962 bytes
Total body sent:        32190000
HTML transferred:       3187672 bytes
Requests per second:    1188.19 [#/sec] (mean)
Time per request:       673.292 [ms] (mean)
Time per request:       0.842 [ms] (mean, across all concurrent requests)
Transfer rate:          557.42 [Kbytes/sec] received
                        3735.15 kb/s sent
                        4292.57 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   9.3      0      48
Processing:    19  335 1088.7     35    7233
Waiting:        1  334 1088.7     34    7233
Total:         23  337 1093.5     35    7242

Percentage of the requests served within a certain time (ms)
  50%     35
  66%     36
  75%     37
  80%     39
  90%    213
  95%   3129
  98%   4321
  99%   7216
 100%   7242 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking php (be patient)


Server Software:        nginx/1.16.0
Server Hostname:        php
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      900
Time taken for tests:   8.609 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      461
Total transferred:      4787942 bytes
Total body sent:        36190000
HTML transferred:       3172552 bytes
Requests per second:    1161.51 [#/sec] (mean)
Time per request:       774.853 [ms] (mean)
Time per request:       0.861 [ms] (mean, across all concurrent requests)
Transfer rate:          543.09 [Kbytes/sec] received
                        4104.99 kb/s sent
                        4648.08 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  11.0      0      54
Processing:    19  431 1283.7     37    7426
Waiting:        1  431 1283.6     37    7426
Total:         26  435 1288.6     37    7448

Percentage of the requests served within a certain time (ms)
  50%     37
  66%     38
  75%     40
  80%     41
  90%   1131
  95%   3258
  98%   7205
  99%   7257
 100%   7448 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking php (be patient)


Server Software:        nginx/1.16.0
Server Hostname:        php
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      1000
Time taken for tests:   8.672 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      698
Total transferred:      4745756 bytes
Total body sent:        40200000
HTML transferred:       3132736 bytes
Requests per second:    1153.17 [#/sec] (mean)
Time per request:       867.177 [ms] (mean)
Time per request:       0.867 [ms] (mean, across all concurrent requests)
Transfer rate:          534.44 [Kbytes/sec] received
                        4527.08 kb/s sent
                        5061.52 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5  12.9      0      61
Processing:    19  486 1396.4     37    7484
Waiting:        1  486 1396.3     37    7484
Total:         26  491 1402.9     37    7497

Percentage of the requests served within a certain time (ms)
  50%     37
  66%     39
  75%     42
  80%     57
  90%   1157
  95%   3336
  98%   7255
  99%   7463
 100%   7497 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking node (be patient)


Server Software:        
Server Hostname:        node
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      100
Time taken for tests:   4.390 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      800201 bytes
Total body sent:        4190000
HTML transferred:       50201 bytes
Requests per second:    2277.67 [#/sec] (mean)
Time per request:       43.905 [ms] (mean)
Time per request:       0.439 [ms] (mean, across all concurrent requests)
Transfer rate:          177.99 [Kbytes/sec] received
                        931.98 kb/s sent
                        1109.96 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0       9
Processing:     8   43   8.7     42      93
Waiting:        8   43   8.6     42      93
Total:         16   44   8.8     42      97

Percentage of the requests served within a certain time (ms)
  50%     42
  66%     45
  75%     47
  80%     48
  90%     53
  95%     63
  98%     69
  99%     75
 100%     97 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking node (be patient)


Server Software:        
Server Hostname:        node
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      200
Time taken for tests:   3.745 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      809165 bytes
Total body sent:        8190000
HTML transferred:       59165 bytes
Requests per second:    2670.49 [#/sec] (mean)
Time per request:       74.893 [ms] (mean)
Time per request:       0.374 [ms] (mean, across all concurrent requests)
Transfer rate:          211.02 [Kbytes/sec] received
                        2135.87 kb/s sent
                        2346.90 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.6      0      16
Processing:     6   74  10.6     74     123
Waiting:        1   73  10.9     73     122
Total:         17   74   9.7     74     123

Percentage of the requests served within a certain time (ms)
  50%     74
  66%     77
  75%     80
  80%     81
  90%     86
  95%     90
  98%     94
  99%     96
 100%    123 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking node (be patient)


Server Software:        
Server Hostname:        node
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      300
Time taken for tests:   3.756 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      810199 bytes
Total body sent:        12200000
HTML transferred:       60199 bytes
Requests per second:    2662.53 [#/sec] (mean)
Time per request:       112.675 [ms] (mean)
Time per request:       0.376 [ms] (mean, across all concurrent requests)
Transfer rate:          210.66 [Kbytes/sec] received
                        3172.15 kb/s sent
                        3382.81 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.6      0      32
Processing:     8  110  14.9    110     164
Waiting:        1  110  15.5    109     164
Total:         33  111  12.4    110     164

Percentage of the requests served within a certain time (ms)
  50%    110
  66%    112
  75%    113
  80%    114
  90%    122
  95%    138
  98%    144
  99%    147
 100%    164 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking node (be patient)


Server Software:        
Server Hostname:        node
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      400
Time taken for tests:   4.133 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      811073 bytes
Total body sent:        16200000
HTML transferred:       61073 bytes
Requests per second:    2419.54 [#/sec] (mean)
Time per request:       165.321 [ms] (mean)
Time per request:       0.413 [ms] (mean, across all concurrent requests)
Transfer rate:          191.64 [Kbytes/sec] received
                        3827.78 kb/s sent
                        4019.43 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   4.3      0      34
Processing:    35  160  17.9    163     192
Waiting:        1  160  20.7    163     192
Total:         35  161  14.1    163     192

Percentage of the requests served within a certain time (ms)
  50%    163
  66%    165
  75%    167
  80%    168
  90%    171
  95%    174
  98%    183
  99%    185
 100%    192 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking node (be patient)


Server Software:        
Server Hostname:        node
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      500
Time taken for tests:   4.917 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      813277 bytes
Total body sent:        20200000
HTML transferred:       63277 bytes
Requests per second:    2033.80 [#/sec] (mean)
Time per request:       245.845 [ms] (mean)
Time per request:       0.492 [ms] (mean, across all concurrent requests)
Transfer rate:          161.53 [Kbytes/sec] received
                        4011.99 kb/s sent
                        4173.52 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   7.1      0      49
Processing:    14  237  29.5    244     269
Waiting:        1  236  35.5    243     269
Total:         50  239  23.1    244     269

Percentage of the requests served within a certain time (ms)
  50%    244
  66%    246
  75%    247
  80%    248
  90%    250
  95%    252
  98%    254
  99%    257
 100%    269 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking node (be patient)


Server Software:        
Server Hostname:        node
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      600
Time taken for tests:   6.158 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      819945 bytes
Total body sent:        24200000
HTML transferred:       69945 bytes
Requests per second:    1623.81 [#/sec] (mean)
Time per request:       369.502 [ms] (mean)
Time per request:       0.616 [ms] (mean, across all concurrent requests)
Transfer rate:          130.02 [Kbytes/sec] received
                        3837.51 kb/s sent
                        3967.53 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   7.7      0      48
Processing:    16  356  53.5    362     461
Waiting:        1  354  59.8    362     458
Total:         49  358  46.7    362     461

Percentage of the requests served within a certain time (ms)
  50%    362
  66%    367
  75%    371
  80%    379
  90%    389
  95%    424
  98%    430
  99%    435
 100%    461 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking node (be patient)


Server Software:        
Server Hostname:        node
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      700
Time taken for tests:   7.495 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      820017 bytes
Total body sent:        28200000
HTML transferred:       70017 bytes
Requests per second:    1334.18 [#/sec] (mean)
Time per request:       524.668 [ms] (mean)
Time per request:       0.750 [ms] (mean, across all concurrent requests)
Transfer rate:          106.84 [Kbytes/sec] received
                        3674.20 kb/s sent
                        3781.04 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   9.5      0      55
Processing:    17  503  72.2    522     560
Waiting:        2  499  85.9    522     560
Total:         57  505  63.6    522     560

Percentage of the requests served within a certain time (ms)
  50%    522
  66%    525
  75%    527
  80%    530
  90%    535
  95%    539
  98%    542
  99%    546
 100%    560 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking node (be patient)


Server Software:        
Server Hostname:        node
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      800
Time taken for tests:   8.652 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      820010 bytes
Total body sent:        32200000
HTML transferred:       70010 bytes
Requests per second:    1155.77 [#/sec] (mean)
Time per request:       692.178 [ms] (mean)
Time per request:       0.865 [ms] (mean, across all concurrent requests)
Transfer rate:          92.55 [Kbytes/sec] received
                        3634.36 kb/s sent
                        3726.91 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  12.2      0      67
Processing:    20  659  93.9    691     707
Waiting:        2  651 122.1    690     707
Total:         69  662  82.8    691     707

Percentage of the requests served within a certain time (ms)
  50%    691
  66%    693
  75%    694
  80%    695
  90%    697
  95%    699
  98%    701
  99%    702
 100%    707 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking node (be patient)


Server Software:        
Server Hostname:        node
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      900
Time taken for tests:   10.751 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      820013 bytes
Total body sent:        36200000
HTML transferred:       70013 bytes
Requests per second:    930.17 [#/sec] (mean)
Time per request:       967.568 [ms] (mean)
Time per request:       1.075 [ms] (mean, across all concurrent requests)
Transfer rate:          74.49 [Kbytes/sec] received
                        3288.29 kb/s sent
                        3362.77 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  13.6      0      68
Processing:    25  918 148.7    965    1000
Waiting:        2  912 173.1    965     997
Total:         71  922 135.8    965    1000

Percentage of the requests served within a certain time (ms)
  50%    965
  66%    969
  75%    972
  80%    974
  90%    978
  95%    980
  98%    983
  99%    986
 100%   1000 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking node (be patient)


Server Software:        
Server Hostname:        node
Server Port:            80

Document Path:          /
Document Length:        Variable

Concurrency Level:      1000
Time taken for tests:   12.719 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      820021 bytes
Total body sent:        40210000
HTML transferred:       70021 bytes
Requests per second:    786.22 [#/sec] (mean)
Time per request:       1271.903 [ms] (mean)
Time per request:       1.272 [ms] (mean, across all concurrent requests)
Transfer rate:          62.96 [Kbytes/sec] received
                        3087.31 kb/s sent
                        3150.27 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6  18.2      0      92
Processing:    26 1197 195.1   1262    1296
Waiting:        4 1186 234.4   1262    1296
Total:         96 1204 178.1   1262    1297

Percentage of the requests served within a certain time (ms)
  50%   1262
  66%   1266
  75%   1269
  80%   1271
  90%   1283
  95%   1286
  98%   1287
  99%   1288
 100%   1297 (longest request)